[
  {
    "slug": "whitepaper",
    "title": "Whitepaper",
    "subtitle": "Swarm<br>team",
    "href": "/p/whitepaper/",
    "img": "/whitepaper.png",
    "authors": "Authored by the Swarm team",
    "release": "v1.0 of 13 June 2021",
    "updated": "13 June 2021",
    "pdf": "https://www.ethswarm.org/swarm-whitepaper.pdf",
    "content": "The Swarm Whitepaper describes the architecture and operational details of the Swarm network. It is aimed at introducing Swarm to a wide audience of readers, especially developers, technologists and researchers keen on learning about Swarm. Included in the paper is a description of the Distributed Immutable Store of Chunks (DISC), emphasising scalability, privacy and resilience, as well as Swarm's API functionalities, such as file management and messaging. The paper also elaborates on Swarm’s blockchain-based economic model and highlights the role of the BZZ token. This whitepaper is a crucial read for those aiming to gain a comprehensive technical insight into Swarm's role in fostering a digitally autonomous society."
  },
  {
    "slug": "book-of-swarm",
    "title": "The Book Of Swarm",
    "subtitle": "Viktor<br>Trón",
    "href": "/p/book-of-swarm/",
    "img": "/book_of_swarm.png",
    "authors": "Viktor Trón",
    "release": "February 2024",
    "updated": "February 2024",
    "pdf": "https://www.ethswarm.org/the-book-of-swarm-2.pdf",
    "content": "An essential introduction to Swarm for technically inclined readers, \"The Book of Swarm\" delves into the project's design, architecture and core principles. Ideal for developers, researchers and decentralisation experts, it provides a detailed exploration of Swarm's functionality, starting with a historical context of the Web and evolving data sovereignty concepts. This book is a vital resource for those seeking to understand or contribute to the Swarm project, offering in-depth technical insights and high-level specifications."
  },
  {
    "slug": "swarm-protocol-specification",
    "title": "Swarm Protocol Specification",
    "subtitle": "Swarm<br>team",
    "href": "/p/swarm_protocol_spec.pdf/",
    "img": "/swarm_protocol_spec.png",
    "authors": "Authored by the Swarm team",
    "release": "Draft of September 11, 2025",
    "updated": "September 11, 2025",
    "pdf": "swarm_protocol_spec.pdf",
    "content": "The Swarm Specification document is an essential resource for developers and software engineers seeking to build their own Swarm client or integrate Swarm's functionalities into their applications. This document provides a detailed exposition of the low-level implementation details of the Swarm network, its technical infrastructure, protocols, and APIs. It is aimed at readers with a solid understanding of decentralised systems and peer-to-peer technologies who require in-depth technical guidance for practical implementation. The specifications cover the aspects of data storage, content distribution and network communication within Swarm."
  },
  {
    "slug": "erasure",
    "title": "Erasure Coding paper",
    "subtitle": "Swarm<br>team",
    "href": "/p/erasure/",
    "img": "/erasure.png",
    "authors": "Swarm Research Division",
    "release": "v1.0",
    "updated": "January 25, 2024",
    "pdf": "/erasure-coding.pdf",
    "content": "This document provides a technical exploration of erasure coding in the Swarm network, focusing on ensuring data integrity and resilience. It details the implementation of Reed-Solomon coding within Swarm's hash tree structure for robust data storage and recovery. The paper is ideal for developers and engineers seeking a deep understanding of Swarm's data handling mechanisms, particularly in scenarios of network faults and attacks. Key aspects include handling incomplete data sets and optimizing retrieval strategies, making it a critical read for those involved in the technical aspects of decentralised data storage."
  },
  {
    "slug": "swarm-formal-spec",
    "title": "Swarm Formal Specification",
    "subtitle": "Swarm<br>Research Division",
    "href": "/p/swarm-formal-spec/",
    "img": "/swarm_formal_spec.png",
    "authors": "Swarm Research Division",
    "release": "Draft of August 12, 2025",
    "updated": "August 12, 2025",
    "pdf": "/specs_def.pdf",
    "content": "The Swarm Formal Specification is a comprehensive technical document that formally defines the data structures, algorithms, and game-theoretic mechanisms underlying the Swarm network. It covers the Distributed Immutable Store of Chunks (DISC), chunk addressing, Single Owner Chunks, postage stamps, and redistribution game mechanics. It also details the APIs, cryptographic primitives, and protocols used to ensure integrity, availability, and incentivization within the system."
  },
  {
    "slug": "price-oracle",
    "title": "Price Oracle",
    "subtitle": "Swarm<br>Research Division",
    "href": "/p/price-oracle/",
    "img": "/price_oracle.png",
    "authors": "Swarm Research Division",
    "release": "Draft of March 4, 2025",
    "updated": "March 4, 2025",
    "pdf": "/price_oracle.pdf",
    "content": "This document describes the Swarm price oracle smart contract, which determines the unit price of storage based on the redistribution game. It introduces a price function where storage rent adapts to supply and demand, measured by the number of honest revealers in neighbourhoods. The paper defines the reactivity parameter, explains how skipped rounds are treated, and details the exponential adjustment formula for price evolution over rounds."
  },
  {
    "slug": "batch-utilisation",
    "title": "Batch Utilisation",
    "subtitle": "György Barabás <br>& Viktor Trón",
    "href": "/p/batch-utilisation/",
    "img": "/batch_utilisation.png",
    "authors": "György Barabás & Viktor Trón",
    "release": "Draft of April 7, 2025",
    "updated": "April 7, 2025",
    "pdf": "/batch_utilisation.pdf",
    "content": "This paper explores the effective utilization of postage batches in Swarm. It explains how batches, structured as collections of storage slots, enforce fair and detectable issuance of postage stamps across buckets. Using probabilistic models such as the negative binomial distribution and extreme value theory, it quantifies expected batch utilization and calibrates user-facing estimates of storage availability. It also discusses practical considerations such as packed address chunks and erasure coding."
  },
  {
    "slug": "erasure-stats",
    "title": "Erasure Statistics",
    "subtitle": "Swarm<br>Research Division",
    "href": "/p/erasure-stats/",
    "img": "/erasure_stats.png",
    "authors": "Swarm Research Division",
    "release": "Draft of March 14, 2025",
    "updated": "March 14, 2025",
    "pdf": "/erasure_stats.pdf",
    "content": "This document provides a statistical analysis of erasure coding in Swarm. It models the probability of data corruption under various error rates and parity configurations, using binomial distributions to estimate reliability. The study addresses how many parity chunks are required for different error tolerances and chunk counts, with results summarized in figures and tables. Separate analyses are provided for unencrypted and encrypted chunks, highlighting how parity overhead influences reliability guarantees."
  },
  {
    "slug": "dream-paper",
    "title": "DREAM Paper",
    "subtitle": "Viktor Tron &<br>Henning Diedrich",
    "href": "/p/dream-paper/",
    "img": "/dream_paper.png",
    "authors": "Swarm Research Division",
    "release": "Draft of March 14, 2025",
    "updated": "March 14, 2025",
    "pdf": "/dream-paper.pdf",
    "content": "This work introduces DREAM, a novel construct that enables deletable content in otherwise immutable, decentralized storage systems such as Swarm. The paper contributes a new deletion model that is based on access revocation and presents a mechanism that allows data-sharing users to grant and later rescind access to specific data to specific consumers. The solution leverages Swarm’s distributed storage architecture to introduce a distributed one-time pad mechanism realized by a network protocol."
  }
]
